app/Controllers/BarangController.php

    public function index()
    {
        $data = [
            'title' => 'Data Barang',
            'barang' => $this->barangModel->findAll()
        ];
---
SELECT *
FROM `barang`

    public function delete($id)
    {
         $barang = $this->barangModel->find($id);

        if ($barang) {
            // Hapus data barang
            if ($this->barangModel->delete($id)) {
                return redirect()->to('/barang')->with('pesan', 'Data barang berhasil dihapus!');
            } else {
                return redirect()->to('/barang')->with('pesan', 'Gagal menghapus data barang.');
---
DELETE FROM `barang`
WHERE `id` IN ('66')
SELECT *
FROM `barang`
WHERE `barang`.`id` = '66'