app/Controllers/ClientController.php

SELECT *
FROM `users`
WHERE `username` = 'rizki'
 LIMIT 1
---
    public function profile()
    {
        $session = session();
        $username = $session->get('username'); // Ambil username dari session

        // Ambil data pengguna dari database berdasarkan username
        $user = $this->usersModel->where('username', $username)->first();