app/Controllers/ClientDashboardController.php

    public function index()
    {
        $session = session();
        $jasaModel = new JasaModel();
        $services = $jasaModel->findAll();
---
SELECT *
FROM `jasa`