app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `username` = 'jaya' AND `password` = '25d55ad283aa400af464c76d713c07ad'
 LIMIT 1
---
    public function ceklogin()
    {
        $session = session();
        $userModel = new UsersModel();
        $username     = $this->request->getVar('username');
        $password     = md5($this->request->getVar('password'));
        // dd($userModel->findAll());
        $user = $userModel->where("username ='$username' AND password='$password'")->first();