app/Controllers/Home.php

SELECT *
FROM `tbl_users`
WHERE `username` = 'admin12345' AND `password` = '827ccb0eea8a706c4c34a16891f84e7b'
 LIMIT 1
SELECT *
FROM `users`
WHERE `username` = 'rizki' AND `password` = '25d55ad283aa400af464c76d713c07ad'
 LIMIT 1
---
    public function ceklogin()
    {
        $session = session();
        $userModel = new UsersModel();
        $username     = $this->request->getVar('username');
        $password     = md5($this->request->getVar('password'));
        $user = $userModel->where("username ='$username' AND password='$password'")->first();