app/Controllers/InvoiceController.php

    public function delete()
    {
        $id = $this->request->getGet('id_kontrak');
        $session = session();

        if (!empty($session->get('username')) && !empty($session->get('id_level'))) {
            if (!empty($id)) {
                if ($this->invoiceModel->delete($id)) {
---
DELETE FROM `invoice`
WHERE `id_kontrak` IN ('14')