app/Controllers/JasaController.php

SELECT *
FROM `jasa`
---
    public function index()
    {
        $session = session();
        if (!empty($session->get('username')) && !empty($session->get('id_level'))) {
            $data = [
                'title' => 'Jasa',
                'jasa'  => $this->model->findAll()