app/Controllers/KontrakController.php

    public function index()
    {
        $session = session();
        if (!empty($session->get('username')) && !empty($session->get('id_level'))) {
            $kliens = $this->kontrakModel->getKlien();
            // dd($this->invoiceModel->getIdUnsurveyedInvoice());
            $data = [
                'title' => 'kontrak',
                'kontrak'  => $this->kontrakModel->findAll(),
                'tagihan' => $this->invoiceModel->getIdUnsurveyedInvoice(),
                'items' => $this->jasaModel->findAll(),
                'kliens' =>  $kliens
            ];
---
SELECT *
FROM `jasa`
SELECT *
FROM `kontrak`