app/Controllers/PaketLayananController.php

    public function index()
    {
        $paket_layanan = $this->paketModel->findAll();

        // Retrieve service and barang details
        foreach ($paket_layanan as &$paket) {
            $service = $this->servicesModel->find($paket['id_services']);
            $paket['service_name'] = $service ? $service['nama'] : 'Unknown'; // Handle missing service

            $barang = $this->barangModel->find($paket['id_barang']);
            $paket['barang_name'] = $barang ? $barang['nama'] : 'Unknown'; // Handle missing barang
        }

        // Prepare data for view
        $data = [
            'title' => 'Data Paket Layanan',
            'paket_layanan' => $paket_layanan,
            'services' => $this->servicesModel->findAll(),
            'barang' => $this->barangModel->findAll()
        ];
---
SELECT *
FROM `services`
WHERE `services`.`id` = '1'
SELECT *
FROM `barang`
WHERE `barang`.`id` = '4'
SELECT *
FROM `paket_layanan`