app/Controllers/PemasanganController.php

    public function index()
    {
        $session = session();
        if (!empty($session->get('username')) && !empty($session->get('id_level'))) {
            // Ambil daftar surveyors
            $id_teknisi = $this->pemasanganModel->getId_teknisi();
            $id_kontrak = $this->pemasanganModel->getId_Kontrak();

            $data = [
                'title' => 'pemasangan',
                'pemasangan'  => $this->pemasanganModel->findAll(),
---
SELECT *
FROM `pemasangan`