app/Controllers/ServiceController.php

SELECT *
FROM `services`
---
    public function index()
    {
        $services = $this->servicesModel->findAll();