app/Controllers/SurveiController.php

SELECT *
FROM `hasil_survei`
---
    public function index()
    {
        $session = session();
        if (!empty($session->get('username')) && !empty($session->get('id_level'))) {
            // Ambil daftar surveyors
            $surveyors = $this->surveiModel->getSurveyors();

            $data = [
                'title' => 'hasil_survei',
                'hasil_survei'  => $this->surveiModel->findAll(),