app/Controllers/UserController.php

    public function index()
    {
        $session = session();
        if (!empty($session->get('username')) && !empty($session->get('id_level'))) {
            $data = [
                'title' => 'users',
                'users'  => $this->usersModel->findAll()
---
SELECT *
FROM `users`