app/Models/InvoiceModel.php

SELECT `id`
FROM `kontrak`
---
    public function getKontrak()
    {
        return $this->db->table('kontrak')
                        ->select('id','harga')
                        ->get()
                        ->getResultArray();

SELECT `id`
FROM `invoice`
WHERE `status` = 'unsurveyed'
---
    public function getIdUnsurveyedInvoice() {
        return array_column(
            $this->db->table('invoice')
                ->select('id')
                ->where('status', 'unsurveyed')
                ->get()
                ->getResultArray(),
            'id'
        );

SELECT `invoice`.*, `users`.`nama` as `nama_user`
FROM `invoice`
JOIN `users` ON `users`.`username` = `invoice`.`username`
---
    public function getData() {
        return $this->db->table('invoice')
                ->select('invoice.*, s.nama as nama_user, t.nama as teknisi, r.nama as surveyor')
                ->join('users s', 's.username = invoice.username')
                ->join('users t', 't.username = invoice.id_teknisi', 'left')
                ->join('users r', 'r.username = invoice.id_surveyor', 'left')
                ->get()
                ->getResultArray();