app/Models/JasaModel.php

SELECT *
FROM `jasa`
WHERE `type` = 'jasa'
---
    public function getJasa() {
        return $this->db->table($this->table)
                        ->select('*')
                        ->where('type', 'jasa')
                        ->get()
                        ->getResultArray();