app/Models/KontrakModel.php

  public function getid_hasil_survei()
  {
      // Gunakan query builder untuk mengambil data dari tabel hasil_survei
      return $this->db->table('hasil_survei')
                      ->select('id')  // Ambil kolom id saja
                      ->get()
                      ->getResultArray();  // Mengembalikan hasil sebagai array
---
SELECT `id`
FROM `hasil_survei`

  public function getKlien()
  {
      // Gunakan query builder untuk mengambil data dari tabel users dengan role 'surveyor'
      return $this->db->table('users')
                      ->select('*')  // Ambil kolom id saja
                      ->where('role', 'klien')  // Kondisi role = surveyor
                      ->get()
                      ->getResultArray();  // Mengembalikan hasil sebagai array
---
SELECT `id`
FROM `users`
WHERE `role` = 'klien'

  public function getData() {
    return $this->db->table('kontrak k')->select('k.*, u.nama as nama_client')
      ->join('users u', 'u.id = k.id_klien')
      ->get()->getResultArray();
---
SELECT `k`.*, `u`.`nama` as `nama_client`
FROM `kontrak` `k`
JOIN `users` `u` ON `u`.`id` = `k`.`id_klien`