app/Models/PaketLayananModel.php

SELECT `s`.`img_url` as `gambar_service`, `pl`.`id_services` as `id`, `s`.`nama` as `nama_service`, (SUM(b.harga * pl.besar) + s.harga) as harga_total, `s`.`deskripsi`
FROM `paket_layanan` `pl`
JOIN `services` `s` ON `s`.`id` = `pl`.`id_services`
JOIN `barang` `b` ON `b`.`id` = `pl`.`id_barang`
GROUP BY `pl`.`id_services`
---
    public function getServiceInfo($id_services = null)
    {
        if (is_null($id_services)) {
            return $this->db->table('paket_layanan pl')
                ->select('s.img_url as gambar_service, pl.id_services as id, s.nama as nama_service,
                         (SUM(b.harga * pl.besar) + s.harga) as harga_total, s.deskripsi')
                ->join('services s', 's.id = pl.id_services')
                ->join('barang b', 'b.id = pl.id_barang')
                ->groupBy('pl.id_services')
                ->get()
                ->getResultArray();

SELECT `s`.`img_url` as `gambar_service`, `pl`.`id_services` as `id`, `s`.`nama` as `nama_service`, (SUM(b.harga * pl.besar) + s.harga) as harga_total, `s`.`deskripsi`
FROM `paket_layanan` `pl`
JOIN `services` `s` ON `s`.`id` = `pl`.`id_services`
JOIN `barang` `b` ON `b`.`id` = `pl`.`id_barang`
JOIN `keranjang` `k` ON `k`.`id_paket_layanan` = `pl`.`id`
JOIN `invoice` `i` ON `i`.`id` = `k`.`id_invoice`
WHERE `i`.`user_username` = 'rizki'
GROUP BY `pl`.`id_services`
---
    public function getKeranjangOf($user_username) {
        return $this->db->table('paket_layanan pl')
            ->select('s.img_url as gambar_service, pl.id_services as id, s.nama as nama_service,
                    (SUM(b.harga * pl.besar) + s.harga) as harga_total, s.deskripsi')
            ->join('services s', 's.id = pl.id_services') // Join tabel services untuk data service
            ->join('barang b', 'b.id = pl.id_barang') // Join tabel barang untuk data barang
            ->join('keranjang k', 'k.id_paket_layanan = pl.id') // Join tabel keranjang untuk menghubungkan paket layanan
            ->join('invoice i', 'i.id = k.id_invoice') // Join tabel invoice untuk mendapatkan invoice yang terkait dengan keranjang
            ->where('i.user_username', $user_username) // Pastikan hanya mengambil yang sesuai dengan user_username
            ->groupBy('pl.id_services') // Kelompokkan hasil berdasarkan id_services
            ->get()
            ->getResultArray();

SELECT DISTINCT b.*, pl.besar as jumlah
FROM `barang` `b`
JOIN `paket_layanan` `pl` ON `pl`.`id_barang` = `b`.`id`
WHERE `pl`.`id_services` = '1'
---
    public function getBarangByService($idServices)
    {
        // Menggunakan query builder untuk menjalankan SQL
        $builder = $this->db->table('barang b');
        $builder->select('DISTINCT b.*, pl.besar as jumlah', false); // Menambahkan DISTINCT
        $builder->join('paket_layanan pl', 'pl.id_barang = b.id'); // Pastikan join sesuai hubungan tabel
        $builder->where('pl.id_services', $idServices); // Menentukan layanan yang sesuai

        // Menjalankan query dan mengembalikan hasilnya
        return $builder->get()->getResultArray();