app/Models/PemasanganModel.php

    public function getId_kontrak()
    {
        // Gunakan query builder untuk mengambil data dari tabel users dengan role 'surveyor'
        return $this->db->table('kontrak')
                        ->select('id')  // Ambil kolom id saja
---
SELECT `id`
FROM `kontrak`

    public function getId_teknisi()
    {
        // Gunakan query builder untuk mengambil data dari tabel users dengan role 'surveyor'
        return $this->db->table('users')
                        ->select('id')  // Ambil kolom id saja
                        ->where('role', 'teknisi')  // Kondisi role = surveyor
                        ->get()
                        ->getResultArray();  // Mengembalikan hasil sebagai array
---
SELECT `id`
FROM `users`
WHERE `role` = 'teknisi'