app/Models/SurveiModel.php

    public function getSurveyors()
    {
        // Gunakan query builder untuk mengambil data dari tabel users dengan role 'surveyor'
        return $this->db->table('users')
                        ->select('id')  // Ambil kolom id saja
                        ->where('role', 'surveyor')  // Kondisi role = surveyor
                        ->get()
                        ->getResultArray();  // Mengembalikan hasil sebagai array
---
SELECT `id`
FROM `users`
WHERE `role` = 'surveyor'