app/Models/UsersModel.php

    public function getUserByRole($role) {
        // dd($role);
        return $this->db->table('users')
                      ->select('*')
                      ->where('role', $role)
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `users`
WHERE `role` = 'klien'